{
  "backend/main.mo": "Main Motoko actor for the KidsLearn backend, defining data types (Lesson, Flashcard, QuizQuestion, GameSession, etc.) and public functions for user profiles, role management, lesson/quiz content, game sessions, progress tracking, and badge awarding with access control.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—child-friendly color scheme and enlarged letter/number display—to their affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering pages, hooks, components, utilities, and routing for the KidsLearn app.",
  "frontend/index.css": "Base Tailwind CSS entry point defining CSS custom properties for the light and dark color themes (backgrounds, borders, charts, sidebar) used by shadcn-ui components.",
  "frontend/index.html": "Minimal HTML shell for the KidsLearn React app, mounting the app into a `#root` div and loading the Vite entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (home, lessons, games, dashboards, etc.) and wraps the app in a QueryClientProvider and shared Header/Footer layout.",
  "frontend/src/components/CelebrationAnimation.tsx": "Canvas-based confetti animation component that spawns 120 colored particles falling from the top of the screen when the `active` prop is true, then calls `onComplete` after 120 frames.",
  "frontend/src/components/layout/Footer.tsx": "A site footer component that renders navigation links (including role-conditional dashboard links) and a caffeine.ai attribution line.",
  "frontend/src/components/layout/Header.tsx": "A sticky header component with logo, back navigation, role-based dashboard shortcut, progress link, and Internet Identity login/logout button.",
  "frontend/src/components/RoleSelectionModal.tsx": "A modal dialog that prompts newly authenticated users to select either a Teacher or Parent role, then navigates them to the appropriate dashboard after setting the role via a mutation.",
  "frontend/src/data/languageData.ts": "Defines TypeScript types and static data arrays for multilingual educational content including alphabets, numbers, vocabulary, poems, quizzes, and flashcards across English, Telugu, Hindi, and Tamil.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, including login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including session progress, lessons, flashcards, quiz questions, mini game content, and badge/role management via the canister actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, and defines utility classes and animations for kid-friendly UI elements like flip cards, confetti, and rainbow text.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider providers.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Page component that displays three age group options (Toddler, Early Learners, Older Kids) as clickable cards and navigates to the subjects page with the selected age group.",
  "frontend/src/pages/AlphabetLesson.tsx": "Interactive alphabet lesson page supporting English, Telugu, Hindi, and Tamil languages with paginated letter cards, images for English letters, and text-to-speech pronunciation on card tap.",
  "frontend/src/pages/Donation.tsx": "Donation page displaying UPI QR code, copyable UPI ID, and bank transfer details with a clipboard copy feature for supporting the KidsLearn platform.",
  "frontend/src/pages/Flashcards.tsx": "Flashcard study page supporting four languages with flip animation, text-to-speech, and previous/next navigation through language-specific card sets.",
  "frontend/src/pages/Home.tsx": "The Home page renders a hero banner, navigation cards grid for all learning sections (alphabet, numbers, vocabulary, games, etc.), and conditionally shows a RoleSelectionModal for newly authenticated users without a profile.",
  "frontend/src/pages/IndiaMap.tsx": "An interactive India map page that displays all Indian states and union territories with their names and capitals translated into English, Telugu, Hindi, and Tamil, with a language selector toggle.",
  "frontend/src/pages/Lessons.tsx": "A lessons viewer page that fetches subject-specific lessons (math, alphabet, science, Telugu, Hindi, English) from the backend with fallback data, supports audio playback, slide navigation, and marks lessons as complete for authenticated users.",
  "frontend/src/pages/MatchingGame.tsx": "A card-matching game where players match emoji cards to their corresponding word cards across four languages (English, Telugu, Hindi, Tamil), tracking moves and showing a celebration animation on completion.",
  "frontend/src/pages/MiniGame.tsx": "A mini-games page offering age-tiered activities (toddler memory matching, early-learner letter drag-and-drop, and backend-driven quiz content), with badge awarding and celebration animation on completion.",
  "frontend/src/pages/Numbers100Lesson.tsx": "Displays an interactive grid of numbers 1–100 with multi-language support (English, Telugu, Hindi, Tamil), allowing kids to tap any number card to hear it spoken via the Web Speech API.",
  "frontend/src/pages/NumbersLesson.tsx": "Displays an interactive grid of numbers 1–10 with multi-language support and emoji icons, allowing kids to tap cards to hear each number spoken aloud using the Web Speech API.",
  "frontend/src/pages/ParentDashboard.tsx": "A protected dashboard for authenticated parents that displays a child's session progress, earned badges, completed lessons, and average quiz scores fetched from the backend.",
  "frontend/src/pages/PoemsLesson.tsx": "Displays poems and rhymes in multiple languages with navigation between poems, allowing kids to tap individual lines or the full poem to hear them read aloud via the Web Speech API.",
  "frontend/src/pages/Progress.tsx": "Shows a logged-in user's learning progress including earned badges, completed lessons, and quiz results; displays a login prompt for unauthenticated users and skeleton loaders while fetching data.",
  "frontend/src/pages/PuzzleGame.tsx": "A letter-tile puzzle game where kids tap shuffled letters to spell words, supporting English, Telugu, Hindi, and Tamil languages with score tracking and celebration animations.",
  "frontend/src/pages/Quiz.tsx": "A multi-language quiz page that presents multiple-choice questions, tracks scores, awards badges, and records results to the backend via Internet Identity authentication.",
  "frontend/src/pages/SubjectSelection.tsx": "A subject and activity selection page that lets users pick from subjects (Math, Alphabet, Science, etc.) and navigate to various learning activities like lessons, flashcards, quizzes, and games.",
  "frontend/src/pages/TeacherDashboard.tsx": "A role-gated teacher dashboard that displays aggregated student progress stats (total students, completed lessons, earned badges) fetched from the backend, with access control enforcing the Teacher role.",
  "frontend/src/pages/TimedChallenge.tsx": "A timed quiz challenge page where each question must be answered within 15 seconds, supporting multiple languages, tracking scores, recording game sessions to the backend, and showing celebration animations on success.",
  "frontend/src/pages/VocabularyLesson.tsx": "React page for a vocabulary learning lesson that lets children select a language (English, Telugu, Hindi, Tamil) and category (animals, fruits, colors, etc.) to view illustrated word cards with text-to-speech pronunciation support.",
  "frontend/src/utils/sessionManager.ts": "Utility that generates and persists a unique session ID in sessionStorage, using crypto.randomUUID when available or a fallback timestamp-based ID.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a child-friendly custom color palette (sunshine, grass, tangerine, cherry, sky, lavender, mint, coral) using OKLCH values, along with custom heading and body font families.",
  "project_state.json": "Project state metadata describing KidsLearn, a children's multilingual learning app, including existing features, pending feature requests for vibrant colors and larger cards, and architectural notes."
}