{
  "backend/main.mo": "Main Motoko actor defining all backend logic including user profiles, roles, lessons, flashcards, quizzes, mini-games, tasks, game sessions, and statistics, with authorization and blob storage mixins included.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor to NewActor by adding an `avatarId` field (defaulting to the user's name) to each user profile.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (post-login profile screen, kids dashboard auto-launch, and dashboard lazy-loading) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing the purpose and key details of each component, page, hook, and utility in the frontend.",
  "frontend/index.css": "Base Tailwind CSS entry file defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the KidsLearn PWA, including meta tags for PWA support, iOS/MS tile icons, a service worker registration script, and the React root div.",
  "frontend/public/manifest.json": "PWA web app manifest for KidsLearn specifying app name, theme colors, display mode, orientation, and icon paths for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing versioned caching with cache-first for static assets, network-first for navigation and API calls, and explicit exclusion of Internet Identity and canister API URLs from caching.",
  "frontend/src/App.tsx": "Sets up the React app with TanStack Router and React Query, defining all application routes (lessons, games, profile, etc.) wrapped in a shared Header/Footer layout.",
  "frontend/src/components/CelebrationAnimation.tsx": "Renders a fullscreen canvas confetti animation with falling colored particles when the `active` prop is true, calling `onComplete` when the animation finishes.",
  "frontend/src/components/GameCard.tsx": "A styled card component that links to a game route, displaying an emoji, name, description, and a 'Play Now' button with customizable color classes.",
  "frontend/src/components/layout/Footer.tsx": "Renders the app footer with navigation links (conditionally showing Dashboard when authenticated), a copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky app header with logo, back navigation, dashboard shortcut, profile link, and Internet Identity login/logout button.",
  "frontend/src/components/LearningCard.tsx": "A styled card component that links to a learning route, displaying an emoji, name, and a 'Learn' button with customizable color classes.",
  "frontend/src/components/ProgressWidget.tsx": "Displays progress bars for completed lessons, tasks, and quizzes taken, computing percentages and showing a completion message when all items are done.",
  "frontend/src/components/RewardsDisplay.tsx": "Shows the user's total earned points and a grid of all possible badges, highlighting earned ones and graying out unearned ones.",
  "frontend/src/components/RoleSelectionModal.tsx": "A modal dialog shown after login that checks the user's profile and redirects them to either the kids dashboard or the profile setup page.",
  "frontend/src/components/TaskCard.tsx": "Displays an individual task with its title, description, and points, allowing the user to mark it complete via a mutation with loading and completed states.",
  "frontend/src/data/languageData.ts": "Defines TypeScript types and static data for supported languages, alphabets, numbers, vocabulary, poems, quizzes, and other lesson content used across the app.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with React context.",
  "frontend/src/hooks/useLanguageState.ts": "React context provider and hook for persisting and accessing the user's selected language (English, Telugu, Hindi, Tamil) via sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching lessons, flashcards, quiz questions, game content, and mutating session progress, badges, and user profiles.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for light/dark themes, and adding utility classes and keyframe animations for kid-friendly UI elements.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Displays a selection screen with three age group cards (Toddlers, Early Learners, Older Kids) and navigates to the subjects page with the chosen age group as a query parameter.",
  "frontend/src/pages/AlphabetFullScreen.tsx": "Full-screen alphabet viewer that cycles through A–Z with vivid per-letter backgrounds, images/emojis, swipe/keyboard navigation, and text-to-speech pronunciation.",
  "frontend/src/pages/AlphabetLesson.tsx": "Displays a grid of alphabet cards supporting four languages (English, Telugu, Hindi, Tamil) with images for English letters A–O and text-to-speech on card tap.",
  "frontend/src/pages/Donation.tsx": "Donation page showing a UPI QR code and copyable UPI ID for supporting KidsLearn, along with impact stats and payment instructions.",
  "frontend/src/pages/Flashcards.tsx": "Interactive flashcard component supporting four languages with flip animation, previous/next navigation, and text-to-speech for each card's content.",
  "frontend/src/pages/Home.tsx": "Main home page that renders a navigation grid of learning activity cards (alphabet, numbers, quiz, games, etc.) and integrates Internet Identity authentication with a role selection modal.",
  "frontend/src/pages/IndiaMap.tsx": "Renders an interactive India map page with multilingual state information (English, Telugu, Hindi, Tamil), displaying state names, capitals, and emojis with a language selector.",
  "frontend/src/pages/KidsDashboard.tsx": "Main kids dashboard page that displays tasks, session progress, rewards, and navigation cards for games and learning modules, with celebration animation on task completion.",
  "frontend/src/pages/Lessons.tsx": "Lessons page that fetches and displays subject-specific lessons with audio support, navigation between slides, and lesson completion tracking via blockchain hooks.",
  "frontend/src/pages/MatchingGame.tsx": "A card-matching game where kids match emoji cards to their corresponding words, supporting four languages (English, Telugu, Hindi, Tamil) with move tracking and a win celebration.",
  "frontend/src/pages/MiniGame.tsx": "A multi-mode mini game page featuring age-tiered activities including a toddler memory matching game and an early learner letter-to-word drag-and-drop game, with badge awarding on completion.",
  "frontend/src/pages/Numbers100Lesson.tsx": "A React page that displays a 1–100 number grid with multi-language support (English, Telugu, Hindi, Tamil), using color-coded cards and Web Speech API to pronounce numbers when tapped.",
  "frontend/src/pages/NumbersLesson.tsx": "A React page showing numbers 1–10 as interactive cards with emoji, supporting four languages and text-to-speech pronunciation on card click.",
  "frontend/src/pages/ParentDashboard.tsx": "An empty file with no content or exports defined.",
  "frontend/src/pages/PictureLesson.tsx": "A React vocabulary lesson page that displays categorized picture cards (animals, food, colors, body parts) with images and multi-language TTS support across English, Telugu, Hindi, and Tamil.",
  "frontend/src/pages/PoemsLesson.tsx": "A React page for browsing and listening to poems/rhymes in four languages, allowing users to tap individual lines or the full poem to trigger text-to-speech playback.",
  "frontend/src/pages/PostLoginProfile.tsx": "A React profile page shown after login that lets users pick an avatar, edit their display name, and view their earned badges, level, and lesson progress fetched from the backend.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays and edits display name, shows earned badges, quiz stats, and completed lessons for authenticated users, with login/logout support via Internet Identity.",
  "frontend/src/pages/Progress.tsx": "Progress tracking page showing earned badges, completed lessons, and quiz results for authenticated users, with a login prompt for unauthenticated visitors.",
  "frontend/src/pages/PuzzleGame.tsx": "Letter-tile word puzzle game supporting English, Telugu, Hindi, and Tamil, where players tap shuffled letter tiles to spell the correct word and earn points.",
  "frontend/src/pages/Quiz.tsx": "Multi-language quiz page that presents multiple-choice questions, tracks score, awards badges, and records results on the backend when the user is authenticated.",
  "frontend/src/pages/SubjectSelection.tsx": "Subject and activity selection page that lets users pick a subject (math, alphabet, science, etc.) or activity (lessons, flashcards, quiz, etc.) and navigates to the corresponding route with age group context.",
  "frontend/src/pages/TeacherDashboard.tsx": "Placeholder page indicating the Teacher Dashboard has been removed, directing users to go home instead.",
  "frontend/src/pages/TimedChallenge.tsx": "A timed quiz game page where kids answer language questions within 15 seconds each, tracking score and recording the session to the backend. Supports English, Telugu, Hindi, and Tamil with a celebration animation on passing.",
  "frontend/src/pages/VocabularyLesson.tsx": "A vocabulary learning page displaying categorized word cards (animals, food, colors, body parts) across multiple languages with text-to-speech pronunciation support.",
  "frontend/src/utils/sessionManager.ts": "Manages a persistent session ID stored in sessionStorage, generating a new UUID-based ID if one does not already exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom kid-friendly color palette (sunshine, grass, tangerine, cherry, sky, lavender, mint, coral) using OKLCH values, along with custom heading and body fonts.",
  "project_state.json": "Project state metadata describing a kids' educational app with features including a post-login profile screen, learning dashboard with progress resumption, and pending backend avatar storage support."
}