{
  "backend/main.mo": "Main Motoko actor for the KidsLearn app, defining persistent types (Lessons, Flashcards, QuizQuestions, etc.), user profile management, session progress tracking, and admin-only content setup, with authorization via AccessControl mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Alphabet, Poems, Numbers lessons with multilingual TTS support) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, utilities, and styles for the KidsLearn multilingual kids education app.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the KidsLearn React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app file that sets up TanStack Router with all application routes (home, lessons, quiz, games, dashboard, etc.) and wraps the app in a QueryClientProvider with a shared Header/Footer layout.",
  "frontend/src/components/CelebrationAnimation.tsx": "Canvas-based confetti animation component that spawns 120 colored particles falling with gravity, running for 120 frames and calling an optional onComplete callback when finished.",
  "frontend/src/components/layout/Footer.tsx": "App footer component displaying the KidsLearn logo, navigation links to Support, Parent Dashboard, and Progress pages, copyright info, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky app header with navigation buttons for back, home, donate, progress, and parent dashboard, plus login/logout controls using Internet Identity authentication.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including lessons, flashcards, quiz questions, mini-game content, session progress, badges, and user profiles.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for theming, and declaring custom animations (flip card, confetti, bounce, wiggle, float, pulse-ring).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Page displaying three age-group selection cards (Toddlers, Early Learners, Older Kids) that navigate to the subjects page with the chosen age group as a query parameter.",
  "frontend/src/pages/AlphabetLesson.tsx": "Renders an interactive alphabet lesson page supporting English, Telugu, Hindi, and Tamil, displaying each of the 26 letters with an image, multilingual word, and text-to-speech pronunciation.",
  "frontend/src/pages/Donation.tsx": "Displays a donation page for KidsLearn with a UPI QR code, copyable UPI ID, and bank transfer details, including a clipboard copy feature with visual feedback.",
  "frontend/src/pages/Flashcards.tsx": "Implements a flip-card flashcard viewer with subject-based fallback data (math, alphabet, science, Telugu, Hindi, English), supporting card navigation, flip animation, and text-to-speech.",
  "frontend/src/pages/Home.tsx": "Renders the KidsLearn home page with a hero banner, logo, and a grid of navigation cards linking to all major learning sections like Numbers, Alphabet, Quiz, and Progress.",
  "frontend/src/pages/IndiaMap.tsx": "Displays an interactive India map lesson listing all states with their names and capitals in four languages (English, Telugu, Hindi, Tamil), with a language selector.",
  "frontend/src/pages/Lessons.tsx": "Displays paginated lessons by subject (math, alphabet, science, Telugu, Hindi, English) with text-to-speech, navigation, and lesson completion tracking. Falls back to hardcoded lesson content if backend data is unavailable.",
  "frontend/src/pages/MatchingGame.tsx": "A multilingual emoji-to-word matching card game supporting English, Telugu, Hindi, and Tamil, with shuffle logic, wrong-pair feedback, attempt tracking, and a celebration animation on completion.",
  "frontend/src/pages/MiniGame.tsx": "Hosts multiple mini-games (memory pairs for toddlers, letter-matching for early learners, and a quiz for older kids) selected by age group, with badge awarding and celebration animation on win.",
  "frontend/src/pages/NumbersLesson.tsx": "An interactive numbers lesson (1–20) with emoji visual counts, multilingual word display (English, Telugu, Hindi, Tamil), and text-to-speech pronunciation support.",
  "frontend/src/pages/ParentDashboard.tsx": "A parent/teacher dashboard requiring Internet Identity login that displays a child's earned badges, completed lessons, quiz results, average score, and weak subject areas.",
  "frontend/src/pages/PoemsLesson.tsx": "A multilingual poems/nursery rhymes page supporting English, Telugu, Hindi, and Tamil, with per-language color themes, expandable poem cards, and text-to-speech playback for each line.",
  "frontend/src/pages/Progress.tsx": "Displays a logged-in user's learning progress including earned badges, completed lessons, and quiz results, with a login prompt for unauthenticated users and skeleton loading states.",
  "frontend/src/pages/PuzzleGame.tsx": "A word unscramble puzzle game supporting four languages where players click shuffled letter tiles to reconstruct words, with score tracking, celebration animations, and game-over handling.",
  "frontend/src/pages/Quiz.tsx": "A subject-based quiz page that fetches questions from the backend (with hardcoded fallbacks), tracks answers, awards badges, and records results for authenticated users via ICP hooks.",
  "frontend/src/pages/SubjectSelection.tsx": "A subject and activity selection hub that lets users navigate to lessons, flashcards, quizzes, mini-games, and other activities filtered by age group and subject.",
  "frontend/src/pages/TimedChallenge.tsx": "A timed quiz game page supporting English, Telugu, Hindi, and Tamil with multiple-choice questions, a countdown timer, score tracking, and a celebration animation on completion.",
  "frontend/src/pages/VocabularyLesson.tsx": "A vocabulary lesson page displaying categorized words (body parts, animals, trees, flowers) with emojis and translations across English, Telugu, Hindi, and Tamil, with text-to-speech support.",
  "frontend/src/utils/sessionManager.ts": "Manages a persistent session ID stored in sessionStorage, generating a new UUID-based ID if one does not already exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (sunshine, grass, tangerine, cherry, sky, lavender) and custom font families (Fredoka One, Nunito) for the kid-friendly app theme.",
  "project_state.json": "Project state metadata for the KidsLearn app, documenting the current version, existing features, architectural notes, known issues, and required image assets for the alphabet section."
}