{
  "backend/main.mo": "Main Motoko actor for the KidsLearn backend, defining data types and state for user profiles, lessons, flashcards, quizzes, tasks, game sessions, and statistics, with authorization and blob storage mixins included.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (logo placement, font size increases, image size increases, etc.) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and notable recent changes across pages, components, hooks, and utilities.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom property color tokens for light and dark themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app with PWA manifest, iOS/MS tile meta tags, app icons, and a service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for Kids Learn specifying app name, theme/background colors, display mode, and icon paths for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Minimal online-only service worker that skips waiting and claims clients immediately but performs no caching, ensuring all network requests pass through directly.",
  "frontend/src/App.tsx": "Main React app entry that sets up TanStack Router with all page routes, wraps the app in a QueryClientProvider, and renders a SplashScreen on initial load before showing the main layout.",
  "frontend/src/components/CelebrationAnimation.tsx": "Renders a full-screen canvas confetti animation with colored falling particles when `active` is true, calling `onComplete` after 120 frames.",
  "frontend/src/components/GameCard.tsx": "A styled link card component for displaying a game with an emoji, name, description, and a 'Play Now' button that navigates to the given route.",
  "frontend/src/components/layout/Footer.tsx": "Renders the app footer with navigation links, a share modal trigger, and attribution text including a caffeine.ai referral link.",
  "frontend/src/components/layout/Header.tsx": "Renders the sticky app header with logo, back navigation, dashboard/profile shortcuts, and Internet Identity login/logout functionality.",
  "frontend/src/components/LearningCard.tsx": "A styled link card component for displaying a learning topic with an emoji, name, and a 'Learn' button that navigates to the given route.",
  "frontend/src/components/ProgressWidget.tsx": "Displays progress bars for completed lessons, tasks, and quizzes taken, with percentage calculations and a completion message when all items are done.",
  "frontend/src/components/RewardsDisplay.tsx": "Shows the user's total earned points from completed tasks and a grid of all badges, highlighting earned ones and greying out unearned ones.",
  "frontend/src/components/RoleSelectionModal.tsx": "A modal shown after login that checks the user's profile and redirects to either the kids dashboard or the profile setup page based on profile completeness.",
  "frontend/src/components/ShareModal.tsx": "A dialog modal that provides share options for the app via WhatsApp, Twitter/X, Facebook, native share API, and a copy-link button.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen animated splash screen with enter/hold/exit phases that displays the app logo, name, and loading dots before calling `onComplete`.",
  "frontend/src/components/TaskCard.tsx": "Displays an individual task with its title, description, and points, allowing the user to mark it complete via a mutation with loading and completed states.",
  "frontend/src/data/languageData.ts": "Defines TypeScript types and static data for supported languages, alphabet cards, number cards, vocabulary, poems, quiz items, and other lesson content used across the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useLanguageState.ts": "Provides a React context and hook for persisting and accessing the user's selected language, backed by sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for fetching and mutating backend data including session progress, lessons, flashcards, quiz questions, mini-game content, badges, and user profiles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind, defines CSS custom properties for light/dark themes using oklch colors, and includes utility classes plus animations for flip cards, confetti, card entrances, and a splash screen.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Page displaying three age group cards (Toddler, Early Learners, Older Kids) that navigate to the subjects page with the selected age group as a search parameter.",
  "frontend/src/pages/AlphabetFullScreen.tsx": "Full-screen alphabet viewer that shows one letter at a time with a vivid background, image/emoji, and word, supporting keyboard/swipe/button navigation and text-to-speech pronunciation.",
  "frontend/src/pages/AlphabetLesson.tsx": "Alphabet learning page displaying letter cards with images and emojis for four languages (English, Telugu, Hindi, Tamil), with text-to-speech on card tap and a language selector.",
  "frontend/src/pages/Donation.tsx": "Donation page showing a UPI QR code and copyable UPI ID for supporting KidsLearn, along with impact stats and payment instructions.",
  "frontend/src/pages/Flashcards.tsx": "Flashcard study page supporting four languages with flip-card animations, text-to-speech, and previous/next navigation through a deck of vocabulary cards.",
  "frontend/src/pages/Home.tsx": "The main home page that displays a grid of navigation cards linking to all learning modules, games, and profile sections, with role selection and share modals integrated.",
  "frontend/src/pages/IndiaMap.tsx": "An interactive India map page that displays all Indian states and territories with their names and capitals translated into English, Telugu, Hindi, and Tamil.",
  "frontend/src/pages/KidsDashboard.tsx": "A personalized kids dashboard showing tasks, session progress, rewards, and quick-access cards for games and learning modules, with a celebration animation on completion.",
  "frontend/src/pages/Lessons.tsx": "A lesson viewer page that fetches or falls back to hardcoded lessons by subject (math, alphabet, science, Telugu, Hindi, English), supporting audio playback, navigation between slides, and lesson completion tracking.",
  "frontend/src/pages/MatchingGame.tsx": "A card-matching game where players pair emoji cards with their corresponding word cards, supporting four languages and tracking moves with a win celebration animation.",
  "frontend/src/pages/MiniGame.tsx": "Implements age-tiered mini-games (memory matching for toddlers, drag-and-drop letter matching for early learners, and a quiz for older kids) with badge awarding on completion and a celebration animation.",
  "frontend/src/pages/Numbers100Lesson.tsx": "Displays an interactive 1–100 number grid supporting English, Telugu, Hindi, and Tamil, with text-to-speech playback when a number card is tapped.",
  "frontend/src/pages/NumbersLesson.tsx": "Renders a 1–10 number lesson with colorful cards and emoji representations, supporting four languages with text-to-speech on card click.",
  "frontend/src/pages/ParentDashboard.tsx": "Empty file with no content; the ParentDashboard page has not been implemented yet.",
  "frontend/src/pages/PictureLesson.tsx": "Shows a vocabulary picture lesson with categorized word cards (animals, food, colors, body parts) across four languages, using images and text-to-speech on tap.",
  "frontend/src/pages/PoemsLesson.tsx": "Presents a paginated poems and rhymes lesson in four languages, allowing users to tap individual lines or the full poem to trigger text-to-speech playback.",
  "frontend/src/pages/PostLoginProfile.tsx": "A post-login profile page where authenticated users can select an avatar, edit their display name, and view their earned badges, completed lessons, and level based on quiz points. It uses React state for editing and transitions, and persists changes via the saveProfile mutation.",
  "frontend/src/pages/Profile.tsx": "A profile page for authenticated users displaying their display name (editable), principal ID, role, badges, and quiz statistics. Handles login/logout flows and shows a login prompt for unauthenticated users.",
  "frontend/src/pages/Progress.tsx": "A progress tracking page that displays a user's earned badges, completed lessons, and quiz results fetched from session data. Shows a login prompt for unauthenticated users and skeleton loaders while data is loading.",
  "frontend/src/pages/PuzzleGame.tsx": "An interactive word puzzle game where players tap shuffled letter tiles to spell words in English, Telugu, Hindi, or Tamil. Tracks score, shows a celebration animation on correct answers, and supports resetting or advancing to the next word.",
  "frontend/src/pages/Quiz.tsx": "A multiple-choice quiz page supporting multiple languages that tracks answers, calculates scores, and on completion awards badges and records results to the backend for authenticated users. Includes celebration animation for passing scores and allows restarting or switching languages.",
  "frontend/src/pages/SubjectSelection.tsx": "Displays a subject selection grid (Math, Alphabet, Science, etc.) and an activities list (Lessons, Flashcards, Quiz, etc.), navigating to the chosen route with ageGroup and subject query params.",
  "frontend/src/pages/TeacherDashboard.tsx": "Placeholder page that informs users the Teacher Dashboard has been removed and redirects them to the home page.",
  "frontend/src/pages/TimedChallenge.tsx": "A timed quiz game where users answer language questions within 15 seconds each, tracking score, recording results via a backend mutation, and showing a celebration animation on high scores.",
  "frontend/src/pages/VocabularyLesson.tsx": "Displays vocabulary words grouped by category (animals, food, colors, body parts) for a selected language, with text-to-speech pronunciation support for each word.",
  "frontend/src/utils/sessionManager.ts": "Manages a persistent session ID stored in sessionStorage, generating a new UUID-based ID if one does not already exist.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom child-friendly color palette (sunshine, grass, tangerine, cherry, sky, lavender, mint, coral) using OKLCH values, along with custom fonts and dark mode settings.",
  "project_state.json": "Tracks the KidsLearn project state including existing features (logo placement, font size increases, image size increases) and pending new feature requests for a kids educational app. Contains schema version, architectural notes, and feature metadata."
}