{
  "backend/main.mo": "Main Motoko actor defining the app's backend with user profiles, roles (parent/student), lessons, flashcards, quizzes, mini-games, game sessions, and access control via authorization and blob-storage mixins.",
  "backend/migration.mo": "Migration module that removes the teacher role from userRoles and userProfiles maps, converting any remaining roles to parent or student in the new schema.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: removal of the Teacher role from the frontend and backend, and displaying a Paytm UPI QR code on the Donation page.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing each component's purpose, recent changes, and key functionality.",
  "frontend/index.css": "Base Tailwind CSS entry file defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the KidsLearn app that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React app router using TanStack Router, defining all page routes within a shared Header/Footer layout; TeacherDashboard route has been removed.",
  "frontend/src/components/CelebrationAnimation.tsx": "Canvas-based confetti animation component that renders 120 falling colored particles for a fixed duration when the active prop is true.",
  "frontend/src/components/layout/Footer.tsx": "A site footer with navigation links to all main routes, conditionally showing the Parent Dashboard link for authenticated parents, plus attribution and copyright info.",
  "frontend/src/components/layout/Header.tsx": "A sticky header with logo, back navigation, role-based dashboard link, profile button, and a login/logout button using Internet Identity authentication.",
  "frontend/src/components/RoleSelectionModal.tsx": "A modal dialog that prompts unauthenticated users to select their role (currently only 'Parent'), sets it via a mutation, and navigates to the parent dashboard on success.",
  "frontend/src/data/languageData.ts": "Defines TypeScript types and static data for multilingual educational content including alphabets, numbers, vocabulary, poems, quizzes, and flashcards across English, Telugu, Hindi, and Tamil.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states.",
  "frontend/src/hooks/useLanguageState.ts": "A React context and hook for managing the selected language, persisting the value to sessionStorage and defaulting to English.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including session progress, lessons, flashcards, quiz questions, mini game content, and badge/role management via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, and defines utility classes and animations for kid-friendly UI elements like flip cards, confetti, and rainbow text.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider providers.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Page component that displays three age group options (Toddler, Early Learners, Older Kids) as clickable cards and navigates to the subjects page with the selected age group.",
  "frontend/src/pages/AlphabetFullScreen.tsx": "Full-screen alphabet slideshow component with swipe/keyboard navigation, text-to-speech, and vivid per-letter background colors for each of the 26 letters with associated words and images.",
  "frontend/src/pages/AlphabetLesson.tsx": "Alphabet learning page that displays letter cards with images and supports switching between English, Telugu, Hindi, and Tamil languages, with text-to-speech on card tap.",
  "frontend/src/pages/Donation.tsx": "Donation page displaying a UPI QR code and copyable UPI ID for accepting payments, along with impact highlights for the KidsLearn platform.",
  "frontend/src/pages/Flashcards.tsx": "A flashcard learning page supporting English, Telugu, Hindi, and Tamil, where users can flip cards to see word/emoji pairs, navigate between cards, and hear text-to-speech pronunciation.",
  "frontend/src/pages/Home.tsx": "The main home page that displays a grid of navigation cards linking to all app sections (alphabet, numbers, vocabulary, games, progress, etc.) with role-based UI and Internet Identity integration.",
  "frontend/src/pages/IndiaMap.tsx": "An interactive India map page listing all states with their names and capitals translated into English, Telugu, Hindi, and Tamil, with a language selector for switching display language.",
  "frontend/src/pages/Lessons.tsx": "A lessons viewer page that fetches structured lessons by subject (math, alphabet, science, Telugu, Hindi, English) from the backend with fallback data, supporting audio playback, navigation between slides, and lesson completion tracking.",
  "frontend/src/pages/MatchingGame.tsx": "A card-matching game where players flip and match emoji-word pairs in a chosen language (English, Telugu, Hindi, Tamil), tracking moves and triggering a celebration animation on completion.",
  "frontend/src/pages/MiniGame.tsx": "Implements age-tiered mini-games (Toddler memory matching, Early Learner letter drag-and-drop, etc.) with win detection, badge awarding via hooks, and a celebration animation on completion.",
  "frontend/src/pages/Numbers100Lesson.tsx": "Displays a 1–100 number grid with multilingual support (English, Telugu, Hindi, Tamil) and text-to-speech playback when a number card is tapped.",
  "frontend/src/pages/NumbersLesson.tsx": "Displays interactive number cards for 1–10 with multilingual labels and emoji, using the Web Speech API to pronounce numbers in the selected language.",
  "frontend/src/pages/ParentDashboard.tsx": "A parent-only dashboard that shows a child's earned badges, completed lessons, and average quiz scores, with role-gating via Internet Identity and logout functionality.",
  "frontend/src/pages/PictureLesson.tsx": "Renders vocabulary picture cards grouped by category (animals, food, colors, body parts) with multilingual labels and TTS pronunciation support across four languages.",
  "frontend/src/pages/PoemsLesson.tsx": "A poems and rhymes lesson page supporting English, Telugu, Hindi, and Tamil, where users can select a language, browse poems, and tap individual lines or the full poem to hear them via the Web Speech API.",
  "frontend/src/pages/Profile.tsx": "A user profile page that handles Internet Identity login/logout, displays and edits the user's display name, shows earned badges, quiz stats, and completed lessons fetched from backend queries.",
  "frontend/src/pages/Progress.tsx": "A progress tracking page that displays earned badges, completed lessons, and quiz results for authenticated users, with loading skeletons and a login prompt for unauthenticated users.",
  "frontend/src/pages/PuzzleGame.tsx": "A letter-tile puzzle game where users tap shuffled letter tiles to spell words in their chosen language (English, Telugu, Hindi, or Tamil), with score tracking and a celebration animation on correct answers.",
  "frontend/src/pages/Quiz.tsx": "A multi-language quiz page that presents multiple-choice questions, tracks the score, awards badges and records results on the backend upon completion, and shows a celebration animation for passing scores.",
  "frontend/src/pages/SubjectSelection.tsx": "Displays a subject selection page with a grid of subjects (Math, Alphabet, Science, etc.) and activity buttons (Lessons, Flashcards, Quiz, etc.) that navigate to the corresponding routes with ageGroup and subject query params.",
  "frontend/src/pages/TeacherDashboard.tsx": "Renders a placeholder page indicating the Teacher Dashboard has been removed, with a button to navigate back to the home page.",
  "frontend/src/pages/TimedChallenge.tsx": "Implements a timed quiz game where users answer language questions within 15 seconds each, tracks score, records the session to the backend, and shows a celebration animation on passing.",
  "frontend/src/pages/VocabularyLesson.tsx": "Displays vocabulary words grouped by category (animals, food, colors, body parts) for a selected language, with text-to-speech pronunciation support via the Web Speech API.",
  "frontend/src/utils/sessionManager.ts": "Provides a utility to get or create a unique session ID stored in sessionStorage, using crypto.randomUUID when available.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with a custom kid-friendly color palette (sunshine, grass, tangerine, cherry, sky, lavender, mint, coral) using OKLCH values, and sets Fredoka One and Nunito as the heading and body fonts.",
  "project_state.json": "Defines project metadata, feature history, and two pending action requests: removing teacher login and displaying a UPI QR code image in the donation page."
}