{
  "backend/main.mo": "Main Internet Computer actor defining all data types (user profiles, lessons, quizzes, games, learning content) and backend logic, with access control and blob storage mixins, and data persistence via migration.",
  "backend/migration.mo": "Migration module that defines OldActor and NewActor stable state shapes and a `run` function that carries over existing data while initializing new learning content fields (numberCards, bodyParts, animalCards, etc.) as empty lists.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry file that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the KidsLearn app that mounts the React app into a `#root` div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React app file that defines all TanStack Router routes and a RootLayout component that enforces auth-based redirects to profile setup or PIN entry before rendering the header/footer shell.",
  "frontend/src/components/CelebrationAnimation.tsx": "Canvas-based confetti animation component that spawns 120 colored particles falling from the top of the screen, running for 120 frames and calling an optional onComplete callback when finished.",
  "frontend/src/components/EditProfileModal.tsx": "A modal dialog component that allows editing a kid's profile name and avatar emoji, using the useUpdateKidsProfile mutation hook and displaying toast notifications on success or failure.",
  "frontend/src/components/layout/Footer.tsx": "A site footer component with navigation links to main app routes and an attribution link to caffeine.ai with the current year copyright.",
  "frontend/src/components/layout/Header.tsx": "A sticky header component with logo, back navigation, profile link, and login/logout button using Internet Identity authentication.",
  "frontend/src/components/RoleSelectionModal.tsx": "An empty file with no content or exports.",
  "frontend/src/data/languageData.ts": "Defines TypeScript types and data for the app's language content including alphabet cards, number cards, vocabulary, poems, and quiz items across English, Telugu, Hindi, and Tamil.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useContentRestrictions.ts": "A hook that reads parental controls data and exposes helper functions to check whether a given subject or game is allowed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useLanguageState.ts": "A React context provider and hook for persisting and accessing the selected language (English, Telugu, Hindi, or Tamil) via sessionStorage.",
  "frontend/src/hooks/usePinLock.ts": "A React context provider and hook that manages a PIN-lock state for the kids' interface, persisting the unlocked status in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on kids profiles, parental controls, display names, and PIN management, all backed by an ICP actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, CSS custom properties for light/dark themes, custom utility classes, and animations like flip cards, confetti, and rainbow text.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AgeGroupSelection.tsx": "Page displaying three age group cards (Toddler, Early Learners, Older Kids) that navigate to the subjects page with the selected age group as a query parameter.",
  "frontend/src/pages/AlphabetFullScreen.tsx": "Full-screen alphabet slideshow with per-letter vivid backgrounds, text-to-speech pronunciation, swipe/keyboard navigation, and associated images or emoji for each letter A–Z.",
  "frontend/src/pages/AlphabetLesson.tsx": "Grid-based alphabet lesson page supporting English, Telugu, Hindi, and Tamil with clickable cards that speak the letter aloud using the Web Speech API.",
  "frontend/src/pages/Donation.tsx": "Donation page displaying a UPI QR code and copyable UPI ID for accepting payments, along with an impact summary of the platform's free educational offerings.",
  "frontend/src/pages/Flashcards.tsx": "A flashcard learning page supporting English, Telugu, Hindi, and Tamil languages, with flip animation, text-to-speech pronunciation, and navigation between cards.",
  "frontend/src/pages/Home.tsx": "The main home page displaying a hero banner, a navigation grid of learning activities, and redirect logic based on authentication state and PIN lock status.",
  "frontend/src/pages/IndiaMap.tsx": "An interactive India map page that displays Indian states with their names and capitals in four languages (English, Telugu, Hindi, Tamil) with emoji indicators.",
  "frontend/src/pages/Lessons.tsx": "A lessons page that fetches and displays subject-based lessons (math, alphabet, science, and regional languages) with audio support, navigation, and completion tracking.",
  "frontend/src/pages/MatchingGame.tsx": "A card-matching game where players pair emojis with their corresponding words across multiple languages, tracking moves and triggering a celebration animation on completion.",
  "frontend/src/pages/MiniGame.tsx": "Implements age-tiered mini-games (memory matching for toddlers, drag-and-drop letter matching for early learners, and a quiz for older kids) with badge awarding via Internet Identity on game completion.",
  "frontend/src/pages/Numbers100Lesson.tsx": "Displays a 1–100 number grid with multilingual support (English, Telugu, Hindi, Tamil) and text-to-speech playback when a number card is tapped.",
  "frontend/src/pages/NumbersLesson.tsx": "Displays a 1–10 number learning page with colorful cards, emoji indicators, and multilingual TTS support for English, Telugu, Hindi, and Tamil.",
  "frontend/src/pages/ParentalControls.tsx": "Provides a parental controls page allowing authenticated parents to edit the child's profile, change the 4-digit PIN, and toggle subject content restrictions.",
  "frontend/src/pages/ParentDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/PictureLesson.tsx": "Renders a picture-based vocabulary lesson with category and language selectors, displaying image cards with TTS pronunciation for animals, food, colors, and body parts across four languages.",
  "frontend/src/pages/PinEntry.tsx": "Full-screen PIN entry page for kids that renders a numeric keypad, verifies the 4-digit PIN via a mutation hook, and navigates home on success or shakes/shows an error on failure.",
  "frontend/src/pages/PoemsLesson.tsx": "Interactive poems and rhymes lesson page supporting English, Telugu, Hindi, and Tamil, allowing kids to tap individual lines or the whole poem to hear them read aloud via the Web Speech API.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying the kid's avatar, badges, and session progress, with PIN-gated profile editing and a button to navigate to parental controls (requiring Internet Identity login).",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form where a logged-in user picks a name, emoji avatar, age, and sets a 4-digit PIN, then submits to create a new kid's profile via a mutation hook.",
  "frontend/src/pages/Progress.tsx": "Progress tracking page that shows the authenticated user's earned badges, completed lessons, and quiz results fetched from session progress, with skeleton loading states and a login prompt for unauthenticated users.",
  "frontend/src/pages/PuzzleGame.tsx": "A letter-tile puzzle game where kids tap shuffled letters to spell words, supporting English, Telugu, Hindi, and Tamil languages with score tracking and celebration animations.",
  "frontend/src/pages/Quiz.tsx": "A multiple-choice quiz page supporting four languages that records results and awards badges on the blockchain via Internet Identity, with celebration animation on passing.",
  "frontend/src/pages/SubjectSelection.tsx": "Displays a grid of subjects (Math, Alphabet, Science, Telugu, Hindi, English) for a given age group, with activity buttons (Lessons, Flashcards, Quiz, Mini-Game) and parent-controlled content locking.",
  "frontend/src/pages/TeacherDashboard.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/TimedChallenge.tsx": "A timed quiz game that gives 15 seconds per question, auto-advances on timeout, records game sessions to the backend, and shows a celebration animation for high scores.",
  "frontend/src/pages/VocabularyLesson.tsx": "Displays vocabulary words grouped by category (animals, food, colors, body parts) across four languages, with text-to-speech pronunciation support for each word.",
  "frontend/src/utils/sessionManager.ts": "Provides a utility to get or create a persistent session ID stored in sessionStorage, using crypto.randomUUID when available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a kid-friendly color palette (sunshine, grass, tangerine, cherry, sky, lavender, mint, coral) with custom fonts (Fredoka One, Nunito) and dark mode support.",
  "project_state.json": "Project state descriptor for a kids learning app (ages 3–12) tracking pending feature requests across Maths, Science, History, multilingual support, and UI theming, along with required image assets and architectural notes."
}