{
  "kind": "build_request",
  "title": "Add logo to app screen and increase text/number/image sizes",
  "projectName": "Kids Learn",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the KidsLearn app logo prominently on the Home page (frontend/src/pages/Home.tsx) and in the sticky Header component (frontend/src/components/layout/Header.tsx). The logo should be a fun, colorful kids-themed SVG or PNG rendered as a visible brand mark alongside the app name. Place it at the top-center of the Home page hero area and as an inline element in the header next to the app title.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add logo on app screen"
        ]
      },
      "acceptanceCriteria": [
        "A logo image or SVG appears at the top of the Home page",
        "The same logo appears in the Header component next to the app name",
        "The logo is clearly visible on both mobile and desktop screen sizes",
        "The logo does not overlap or obscure navigation elements"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Increase the font sizes for all primary text, headings, numbers, and labels throughout the app. This includes: number cards in NumbersLesson, Numbers100Lesson; alphabet cards in AlphabetLesson and AlphabetFullScreen; quiz question and answer text in Quiz and TimedChallenge; lesson body text in Lessons; vocabulary and picture card labels in VocabularyLesson and PictureLesson; and dashboard stat numbers in KidsDashboard and ProgressWidget. Bump base text sizes up at least one Tailwind size step (e.g. text-lg → text-xl, text-2xl → text-3xl) and heading/number display sizes by at least two steps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Increase the size of words ,Numbers and images"
        ]
      },
      "acceptanceCriteria": [
        "Number cards in NumbersLesson and Numbers100Lesson display noticeably larger numerals",
        "Alphabet characters in AlphabetLesson and AlphabetFullScreen are visibly bigger",
        "Quiz and lesson body text is larger and easier to read for kids",
        "Dashboard stat numbers and labels are increased in size",
        "No text overflows its container or becomes unreadable on small screens"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Increase the size of images, emoji illustrations, and card thumbnails across the app. This includes: emoji/image displays in AlphabetLesson, AlphabetFullScreen, PictureLesson, VocabularyLesson, NumbersLesson, GameCard, LearningCard, and MiniGame. Increase image/emoji container sizes by at least 25–40% compared to current sizing, using larger Tailwind size classes (e.g. w-16 h-16 → w-24 h-24, text-4xl emoji → text-6xl).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Increase the size of words ,Numbers and images"
        ]
      },
      "acceptanceCriteria": [
        "Emoji and image elements in alphabet, number, and vocabulary pages are visibly larger",
        "Game and learning card thumbnails/emojis are bigger and more prominent",
        "Card layouts accommodate the larger images without breaking the grid",
        "Changes are consistent across all affected pages"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui/",
    "Do not alter backend logic or data models"
  ],
  "nonGoals": [
    "Adding new pages or routes",
    "Changing the color theme or overall design system",
    "Adding new learning content or backend data",
    "Modifying the PWA manifest icons"
  ],
  "imageRequirements": {
    "required": [
      "Colorful kids-themed app logo with a friendly star or book illustration and bold playful text 'KidsLearn', suitable for both header and splash screen use (kidslearn-logo.dim_256x256.png)"
    ],
    "edits": []
  }
}