{
  "kind": "build_request",
  "title": "Child-friendly colors and larger alphabet/number cards",
  "projectName": "KidsLearn",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a bright, vibrant, child-friendly color scheme throughout the entire app. Use bold, saturated colors for backgrounds, buttons, cards, navigation, and interactive elements. Replace any muted or adult-oriented palette with playful, high-contrast colors that are visually engaging for young children. Ensure the theme is consistent across all pages including Home, AlphabetLesson, NumbersLesson, Numbers100Lesson, MiniGame, MatchingGame, Quiz, VocabularyLesson, PoemsLesson, PuzzleGame, TimedChallenge, and all other pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Make good colour and children friendly"
        ]
      },
      "acceptanceCriteria": [
        "All pages use bright, saturated, playful colors instead of muted tones",
        "Buttons, cards, and interactive elements are visually distinct and colorful",
        "Color contrast is sufficient for readability",
        "The theme is consistent across all pages and components",
        "Colors feel appropriate and engaging for children aged 2–8"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Increase the display size of alphabet letters and number digits across all relevant pages. In AlphabetLesson.tsx, significantly increase the font size of the letter displayed on each card. In NumbersLesson.tsx and Numbers100Lesson.tsx, significantly increase the font size of the number on each card. Cards themselves should also be larger and more tappable. The enlarged size should make letters and numbers immediately readable and prominent for young children.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "alphabet and Number increase the size of it"
        ]
      },
      "acceptanceCriteria": [
        "Alphabet letter characters on cards are noticeably larger than before (e.g., at least 4xl–6xl or equivalent)",
        "Number digits on cards in NumbersLesson and Numbers100Lesson are noticeably larger than before",
        "Cards are large enough to be easily tapped/clicked by young children",
        "Text remains fully visible and not clipped within card boundaries",
        "Changes apply consistently for all supported languages (English, Telugu, Hindi, Tamil)"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Do not change backend logic or data models",
    "Do not remove or break any existing features (alphabet matching, number lessons, quiz, teacher/parent login, etc.)"
  ],
  "nonGoals": [
    "Adding payment, donation, or Stripe integration",
    "Adding new content or subjects",
    "Changing app routing or navigation structure",
    "Modifying backend actor or data schemas"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}