{
  "kind": "build_request",
  "title": "Remove teacher login and add UPI QR code to donation section",
  "projectName": "KidsLearn",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Teacher role entirely from the system. This includes: removing the Teacher option from the RoleSelectionModal, removing teacher-specific role checks and routing in Header, Footer, Home, and App, removing or hiding the TeacherDashboard route, and ensuring only Parent and Admin roles remain functional throughout the application.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "remove the teacher logins",
          "Teacher role/login will be completely removed, keeping only parent and admin logins"
        ]
      },
      "acceptanceCriteria": [
        "The role selection modal does not show a Teacher option",
        "No teacher-specific navigation links appear in Header or Footer",
        "The /teacher-dashboard route is removed or redirects away",
        "Parent and Admin logins continue to work normally",
        "No backend calls reference or assign the Teacher role"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Display the uploaded Paytm UPI QR code image (kamerarajendra098@ptyes, Kamera Rajendraprasad) directly in the Donation page. Replace the existing UPI QR code placeholder with the actual QR code image stored as a static asset. Show the UPI ID 'kamerarajendra098@ptyes' below the QR code, and include a label such as 'Scan with any UPI app (Paytm, PhonePe, BHIM, Google Pay)'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "use the QR code image",
          "UPI QR code image (kamerarajendra098@ptyes) will be displayed directly in the donation section so users can scan it"
        ]
      },
      "acceptanceCriteria": [
        "The Donation page displays the actual Paytm UPI QR code image (not a placeholder)",
        "The UPI ID 'kamerarajendra098@ptyes' is shown below the QR code",
        "A label instructs users to scan with any UPI app",
        "The QR code image is served from frontend/public/assets/generated/",
        "The image is clearly visible and appropriately sized for scanning"
      ]
    }
  ],
  "constraints": [
    "Do not remove or modify the Admin role or admin login flow",
    "Do not remove or modify the Parent role or parent login flow",
    "The UPI QR code image must be served as a static frontend asset, not stored in the backend"
  ],
  "nonGoals": [
    "Adding any new payment processing or integration",
    "Modifying the backend data schema for user roles beyond removing teacher references",
    "Changing the overall visual theme or layout of the app"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}