{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add logo to app screen and increase text/number/image sizes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the KidsLearn app logo prominently on the Home page and in the Header component",
      "acceptanceCriteria": [
        "A logo image or SVG appears at the top of the Home page",
        "The same logo appears in the Header component next to the app name",
        "The logo is clearly visible on both mobile and desktop screen sizes",
        "The logo does not overlap or obscure navigation elements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add the generated KidsLearn logo image (frontend/public/assets/generated/kidslearn-logo.dim_256x256.png) prominently at the top-center of the Home page hero area above the grid of learning activities. Use an img element with appropriate Tailwind sizing classes (e.g., w-32 h-32 md:w-40 md:h-40) to ensure visibility across screen sizes. Position the logo above the app name and tagline in the existing hero section."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add the generated KidsLearn logo image (frontend/public/assets/generated/kidslearn-logo.dim_256x256.png) as an inline element next to the app title 'Kids Learn' in the header. Use a smaller size (e.g., w-8 h-8 md:w-10 md:h-10) to fit within the sticky header bar. Place the logo before or alongside the app name text, ensuring it does not interfere with the back button, dashboard shortcut, profile link, or login button."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase font sizes for all primary text, headings, numbers, and labels throughout the app",
      "acceptanceCriteria": [
        "Number cards in NumbersLesson and Numbers100Lesson display noticeably larger numerals",
        "Alphabet characters in AlphabetLesson and AlphabetFullScreen are visibly bigger",
        "Quiz and lesson body text is larger and easier to read for kids",
        "Dashboard stat numbers and labels are increased in size",
        "No text overflows its container or becomes unreadable on small screens"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/NumbersLesson.tsx",
          "operation": "modify",
          "description": "Increase the font size of the number display on each number card. Bump the main number text up by at least two Tailwind size steps (e.g., from text-6xl to text-8xl or text-9xl). Ensure the number remains centered and readable on mobile and desktop screens without overflow."
        },
        {
          "path": "frontend/src/pages/Numbers100Lesson.tsx",
          "operation": "modify",
          "description": "Increase the font size of the numbers displayed in the 1-100 grid. Bump each number's text size by at least one Tailwind step (e.g., from text-xl to text-2xl or text-3xl). Verify that the grid layout accommodates the larger text without breaking on smaller screens."
        },
        {
          "path": "frontend/src/pages/AlphabetLesson.tsx",
          "operation": "modify",
          "description": "Increase the font size of alphabet characters displayed on each card. Bump the letter text by at least two Tailwind size steps (e.g., from text-4xl to text-6xl or larger). Ensure the characters remain centered and do not overflow their card containers on mobile or desktop."
        },
        {
          "path": "frontend/src/pages/AlphabetFullScreen.tsx",
          "operation": "modify",
          "description": "Increase the font size of the full-screen alphabet character display. Bump the main letter text by at least two Tailwind size steps (e.g., from text-8xl to a custom larger size or text-9xl). Ensure it remains prominent and centered without overflowing the viewport."
        },
        {
          "path": "frontend/src/pages/Quiz.tsx",
          "operation": "modify",
          "description": "Increase the font size of quiz question text and answer option text. Bump question headings by at least two Tailwind steps (e.g., text-xl to text-3xl) and answer text by at least one step (e.g., text-lg to text-xl). Verify readability and ensure no overflow on small screens."
        },
        {
          "path": "frontend/src/pages/TimedChallenge.tsx",
          "operation": "modify",
          "description": "Increase the font size of quiz question text and answer option text. Bump question text by at least two Tailwind steps and answer text by at least one step. Ensure the timer and score displays are also increased for better visibility."
        },
        {
          "path": "frontend/src/pages/Lessons.tsx",
          "operation": "modify",
          "description": "Increase the font size of lesson body text and lesson titles. Bump heading text by at least two Tailwind steps and body text by at least one step (e.g., text-base to text-lg or text-xl). Ensure text remains readable and fits within lesson slide containers."
        },
        {
          "path": "frontend/src/pages/VocabularyLesson.tsx",
          "operation": "modify",
          "description": "Increase the font size of vocabulary word labels on each card. Bump label text by at least one Tailwind step (e.g., text-sm to text-base or text-lg). Ensure words remain centered under their images without overflow."
        },
        {
          "path": "frontend/src/pages/PictureLesson.tsx",
          "operation": "modify",
          "description": "Increase the font size of picture card labels. Bump label text by at least one Tailwind step (e.g., text-sm to text-base or text-lg). Ensure labels remain readable and do not overflow their containers."
        },
        {
          "path": "frontend/src/pages/KidsDashboard.tsx",
          "operation": "modify",
          "description": "Increase the font size of stat numbers and stat labels displayed in the dashboard. Bump stat number text by at least two Tailwind steps (e.g., text-2xl to text-4xl) and label text by at least one step (e.g., text-sm to text-base). Ensure the layout accommodates the larger text without breaking on mobile or desktop."
        },
        {
          "path": "frontend/src/components/ProgressWidget.tsx",
          "operation": "modify",
          "description": "Increase the font size of progress stat numbers and labels. Bump stat numbers by at least two Tailwind steps and labels by at least one step. Ensure the progress bars and text remain aligned and readable on all screen sizes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Increase the size of images, emoji illustrations, and card thumbnails across the app",
      "acceptanceCriteria": [
        "Emoji and image elements in alphabet, number, and vocabulary pages are visibly larger",
        "Game and learning card thumbnails/emojis are bigger and more prominent",
        "Card layouts accommodate the larger images without breaking the grid",
        "Changes are consistent across all affected pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AlphabetLesson.tsx",
          "operation": "modify",
          "description": "Increase the size of emoji/image displays on alphabet cards. Bump image container sizes by at least 25-40% (e.g., from w-16 h-16 to w-24 h-24 or w-32 h-32) and emoji text size from text-4xl to text-6xl or text-7xl. Ensure the card grid layout adapts to the larger content without breaking."
        },
        {
          "path": "frontend/src/pages/AlphabetFullScreen.tsx",
          "operation": "modify",
          "description": "Increase the size of the emoji/image displayed alongside the full-screen alphabet character. Bump the emoji text size from text-4xl to text-6xl or larger, or increase image container dimensions by 25-40%. Ensure the larger content fits within the full-screen layout."
        },
        {
          "path": "frontend/src/pages/PictureLesson.tsx",
          "operation": "modify",
          "description": "Increase the size of picture card images. Bump image container sizes by at least 25-40% (e.g., from w-20 h-20 to w-28 h-28 or w-32 h-32). Ensure the card grid accommodates the larger images without breaking on mobile or desktop."
        },
        {
          "path": "frontend/src/pages/VocabularyLesson.tsx",
          "operation": "modify",
          "description": "Increase the size of emoji/image displays on vocabulary cards. Bump emoji text size from text-4xl to text-6xl or larger, or increase image container dimensions by 25-40%. Ensure the card layout accommodates the larger content."
        },
        {
          "path": "frontend/src/pages/NumbersLesson.tsx",
          "operation": "modify",
          "description": "Increase the size of emoji illustrations on number cards. Bump emoji text size from text-4xl to text-6xl or text-7xl. Ensure the emoji remains centered and fits within the card layout."
        },
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Increase the size of the emoji/icon displayed on each game card. Bump emoji text size from text-4xl to text-6xl or text-7xl. Ensure the card layout accommodates the larger emoji without overflow."
        },
        {
          "path": "frontend/src/components/LearningCard.tsx",
          "operation": "modify",
          "description": "Increase the size of the emoji/icon displayed on each learning card. Bump emoji text size from text-4xl to text-6xl or text-7xl. Ensure the card layout accommodates the larger emoji without overflow."
        },
        {
          "path": "frontend/src/pages/MiniGame.tsx",
          "operation": "modify",
          "description": "Increase the size of emoji or image elements used in the toddler memory card matching game and the early learner letter-matching drag-and-drop game. Bump emoji text size from text-4xl to text-6xl or larger, or increase image container dimensions by 25-40%. Ensure the game grid and drag-and-drop areas accommodate the larger content."
        }
      ]
    }
  ]
}