{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove teacher login and add UPI QR code to donation section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Teacher role entirely from the system, keeping only Parent and Admin roles functional",
      "acceptanceCriteria": [
        "The role selection modal does not show a Teacher option",
        "No teacher-specific navigation links appear in Header or Footer",
        "The /teacher-dashboard route is removed or redirects away",
        "Parent and Admin logins continue to work normally",
        "No backend calls reference or assign the Teacher role"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoleSelectionModal.tsx",
          "operation": "modify",
          "description": "Remove the Teacher role option from the role selection modal. Keep only the Parent role option (Admin role assignment happens via backend). Update the UserRole enum usage to reflect that only 'parent' is selectable by users during onboarding."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Remove any teacher-specific navigation logic and dashboard shortcuts. Ensure the header only shows Parent and Admin dashboard shortcuts based on the user's role. Remove conditional rendering for teacher role."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Remove teacher-specific navigation links from the footer. Ensure only Parent and Admin dashboard links are conditionally rendered based on user role."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Remove any teacher-specific routing logic or role checks from the home page. Ensure role selection modal and navigation only handle Parent and Admin roles."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove or comment out the /teacher-dashboard route registration. Ensure routing configuration only includes parent-dashboard and any admin routes. Remove TeacherDashboard import if no longer needed."
        },
        {
          "path": "frontend/src/pages/TeacherDashboard.tsx",
          "operation": "modify",
          "description": "Add a redirect to the home page at the top of the component to ensure this route is inaccessible. Alternatively, display an 'Access Denied' or 'Page Not Found' message. Keep the file in place to avoid breaking existing imports, but render it non-functional."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display the uploaded Paytm UPI QR code image directly in the Donation page with UPI ID and scanning instructions",
      "acceptanceCriteria": [
        "The Donation page displays the actual Paytm UPI QR code image (not a placeholder)",
        "The UPI ID 'kamerarajendra098@ptyes' is shown below the QR code",
        "A label instructs users to scan with any UPI app",
        "The QR code image is served from frontend/public/assets/generated/",
        "The image is clearly visible and appropriately sized for scanning"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Donation.tsx",
          "operation": "modify",
          "description": "Replace the placeholder UPI QR code image reference with the actual generated QR code at frontend/public/assets/generated/upi-qr.dim_300x300.png. Update the img src to use '/assets/generated/upi-qr.dim_300x300.png'. Display the UPI ID 'kamerarajendra098@ptyes' in a text element directly below the QR code image. Add a label or instruction text such as 'Scan with any UPI app (Paytm, PhonePe, BHIM, Google Pay)' above or below the QR code. Ensure the image has appropriate sizing (e.g., max-width for mobile responsiveness) and alt text for accessibility."
        }
      ]
    }
  ]
}