{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Kids' educational app with a post-login experience featuring a profile screen (avatar, name, progress stats, badges, level, editable fields) that auto-launches into a learning dashboard resuming progress or recommending the next lesson. Includes a fun, colorful kid-friendly UI with progress tracking, badges, and levels.",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-create-a-post-login-profile-screen-that-displays-the-kid-s-avatar-selectable-from-a-set-of-fun-kid-friendly-emoji-illustration-options-editable-display-name-current-level-earned-badges-grid-and-progress-stats-lessons-completed-quizzes-taken-points-earned-the-screen-must-appear-immediately-after-a-successful-internet-identity-login-before-navigating-to-the-learning-dashboard",
      "title": "Create a post-login profile screen that displays the kid's avatar (selectable from a set of fun kid-friendly emoji/illustration options), editable display name, current level, earned badges grid, and progress stats (lessons completed, quizzes taken, points earned). The screen must appear immediately after a successful Internet Identity login before navigating to the learning dashboard.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-after-the-profile-screen-is-viewed-automatically-launch-the-kids-learning-dashboard-if-the-kid-has-previous-lesson-progress-resume-from-where-they-left-off-and-highlight-the-next-recommended-lesson-if-no-prior-progress-exists-show-a-recommended-starting-lesson-the-transition-should-be-smooth-and-kid-friendly-e-g-a-brief-animated-transition",
      "title": "After the profile screen is viewed, automatically launch the kids' learning dashboard. If the kid has previous lesson progress, resume from where they left off and highlight the next recommended lesson. If no prior progress exists, show a recommended starting lesson. The transition should be smooth and kid-friendly (e.g., a brief animated transition).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-optimise-the-kidsdashboard-page-for-fast-initial-load-by-lazy-loading-non-critical-sections-games-list-tasks-rewards-and-showing-skeleton-loaders-while-data-is-being-fetched-priority-load-the-progress-stats-and-recommended-lesson-card-first-so-the-kid-sees-actionable-content-immediately",
      "title": "Optimise the KidsDashboard page for fast initial load by lazy-loading non-critical sections (games list, tasks, rewards) and showing skeleton loaders while data is being fetched. Priority-load the progress stats and recommended lesson card first so the kid sees actionable content immediately.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Post-login profile screen with avatar (editable), name (editable), progress stats, badges, and current level",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Auto-launch learning dashboard after profile view, resuming where kid left off or recommending next lesson",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Kid-friendly colorful UI with fast-loading content, progress tracking, badges, and levels",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Update the backend to store and retrieve avatar selection as part of the user profile. Add or extend the existing user profile data structure to include an avatarId field (a short string identifier) that can be set and fetched via dedicated update and query calls.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Kids Educational App",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}